{
  "<E_SEQ>": 2,
  "<PAD>": 0,
  "<S_SEQ>": 1,
  "d_1": 236,
  "d_10": 246,
  "d_100": 249,
  "d_11": 240,
  "d_12": 237,
  "d_13": 253,
  "d_14": 248,
  "d_15": 241,
  "d_16": 247,
  "d_17": 243,
  "d_18": 254,
  "d_19": 242,
  "d_2": 228,
  "d_20": 252,
  "d_21": 256,
  "d_22": 257,
  "d_23": 255,
  "d_24": 238,
  "d_25": 261,
  "d_26": 239,
  "d_27": 244,
  "d_28": 260,
  "d_29": 276,
  "d_3": 232,
  "d_30": 288,
  "d_31": 227,
  "d_32": 251,
  "d_33": 245,
  "d_34": 298,
  "d_35": 279,
  "d_36": 250,
  "d_37": 285,
  "d_38": 281,
  "d_39": 282,
  "d_4": 230,
  "d_40": 258,
  "d_41": 294,
  "d_42": 275,
  "d_43": 271,
  "d_44": 278,
  "d_45": 267,
  "d_46": 265,
  "d_47": 263,
  "d_48": 266,
  "d_49": 264,
  "d_5": 233,
  "d_50": 296,
  "d_51": 295,
  "d_52": 274,
  "d_53": 308,
  "d_54": 292,
  "d_55": 286,
  "d_56": 291,
  "d_57": 289,
  "d_58": 290,
  "d_59": 287,
  "d_6": 229,
  "d_60": 307,
  "d_61": 312,
  "d_62": 300,
  "d_63": 297,
  "d_64": 299,
  "d_65": 273,
  "d_66": 272,
  "d_67": 277,
  "d_68": 259,
  "d_69": 311,
  "d_7": 235,
  "d_70": 304,
  "d_71": 270,
  "d_72": 268,
  "d_73": 317,
  "d_74": 280,
  "d_75": 293,
  "d_76": 310,
  "d_77": 283,
  "d_78": 284,
  "d_79": 324,
  "d_8": 231,
  "d_80": 301,
  "d_81": 306,
  "d_82": 303,
  "d_83": 315,
  "d_84": 309,
  "d_85": 314,
  "d_86": 325,
  "d_87": 322,
  "d_88": 313,
  "d_89": 326,
  "d_9": 234,
  "d_90": 320,
  "d_91": 321,
  "d_92": 305,
  "d_93": 269,
  "d_94": 302,
  "d_95": 262,
  "d_96": 316,
  "d_97": 318,
  "d_98": 319,
  "d_99": 323,
  "p_0": 166,
  "p_1": 190,
  "p_100": 192,
  "p_101": 193,
  "p_102": 195,
  "p_103": 184,
  "p_104": 183,
  "p_105": 194,
  "p_106": 199,
  "p_107": 200,
  "p_108": 201,
  "p_11": 176,
  "p_12": 174,
  "p_127": 189,
  "p_14": 173,
  "p_15": 196,
  "p_16": 172,
  "p_17": 171,
  "p_18": 197,
  "p_19": 170,
  "p_2": 198,
  "p_20": 185,
  "p_21": 169,
  "p_22": 187,
  "p_23": 188,
  "p_24": 168,
  "p_25": 163,
  "p_26": 167,
  "p_27": 186,
  "p_28": 165,
  "p_29": 147,
  "p_30": 149,
  "p_31": 162,
  "p_32": 164,
  "p_33": 155,
  "p_34": 161,
  "p_35": 153,
  "p_36": 154,
  "p_37": 150,
  "p_38": 135,
  "p_39": 145,
  "p_40": 125,
  "p_41": 148,
  "p_42": 136,
  "p_43": 138,
  "p_44": 124,
  "p_45": 111,
  "p_46": 146,
  "p_47": 113,
  "p_48": 137,
  "p_49": 115,
  "p_5": 191,
  "p_50": 117,
  "p_51": 110,
  "p_52": 119,
  "p_53": 131,
  "p_54": 133,
  "p_55": 130,
  "p_56": 106,
  "p_57": 112,
  "p_58": 129,
  "p_59": 108,
  "p_60": 103,
  "p_61": 107,
  "p_62": 102,
  "p_63": 105,
  "p_64": 101,
  "p_65": 104,
  "p_66": 126,
  "p_67": 99,
  "p_68": 109,
  "p_69": 100,
  "p_70": 132,
  "p_71": 114,
  "p_72": 128,
  "p_73": 116,
  "p_74": 118,
  "p_75": 123,
  "p_76": 120,
  "p_77": 134,
  "p_78": 127,
  "p_79": 139,
  "p_8": 202,
  "p_80": 121,
  "p_81": 122,
  "p_82": 143,
  "p_83": 140,
  "p_84": 141,
  "p_85": 144,
  "p_86": 142,
  "p_87": 152,
  "p_88": 151,
  "p_89": 158,
  "p_9": 175,
  "p_90": 157,
  "p_91": 156,
  "p_92": 160,
  "p_93": 159,
  "p_94": 177,
  "p_95": 181,
  "p_96": 180,
  "p_97": 179,
  "p_98": 178,
  "p_99": 182,
  "s_0": 26,
  "s_1": 25,
  "s_10": 19,
  "s_11": 34,
  "s_12": 38,
  "s_13": 40,
  "s_14": 53,
  "s_15": 24,
  "s_16": 27,
  "s_17": 29,
  "s_18": 66,
  "s_19": 80,
  "s_2": 6,
  "s_20": 36,
  "s_21": 56,
  "s_22": 54,
  "s_23": 70,
  "s_24": 45,
  "s_25": 69,
  "s_26": 37,
  "s_27": 97,
  "s_28": 61,
  "s_29": 90,
  "s_3": 12,
  "s_30": 77,
  "s_31": 47,
  "s_32": 48,
  "s_33": 86,
  "s_34": 55,
  "s_35": 65,
  "s_36": 13,
  "s_37": 21,
  "s_38": 9,
  "s_39": 32,
  "s_4": 8,
  "s_40": 39,
  "s_41": 91,
  "s_42": 74,
  "s_43": 41,
  "s_44": 11,
  "s_45": 31,
  "s_46": 20,
  "s_47": 71,
  "s_48": 46,
  "s_49": 95,
  "s_5": 33,
  "s_50": 96,
  "s_51": 92,
  "s_52": 42,
  "s_53": 99,
  "s_54": 83,
  "s_55": 18,
  "s_56": 15,
  "s_57": 17,
  "s_58": 87,
  "s_59": 51,
  "s_6": 7,
  "s_60": 62,
  "s_61": 93,
  "s_62": 67,
  "s_63": 30,
  "s_64": 3,
  "s_65": 49,
  "s_66": 58,
  "s_67": 52,
  "s_68": 60,
  "s_69": 89,
  "s_7": 16,
  "s_70": 57,
  "s_71": 35,
  "s_72": 4,
  "s_73": 50,
  "s_74": 75,
  "s_75": 76,
  "s_76": 5,
  "s_77": 88,
  "s_78": 81,
  "s_79": 22,
  "s_8": 10,
  "s_80": 23,
  "s_81": 72,
  "s_82": 84,
  "s_83": 64,
  "s_84": 44,
  "s_85": 82,
  "s_86": 73,
  "s_87": 68,
  "s_88": 59,
  "s_89": 85,
  "s_9": 14,
  "s_90": 79,
  "s_91": 63,
  "s_92": 43,
  "s_93": 94,
  "s_94": 78,
  "s_95": 28,
  "s_96": 98
}