{
  "0": 0,
  "1": 252064,
  "10": 1002181,
  "100": 405431,
  "101": 421726,
  "102": 486449,
  "103": 441216,
  "104": 385900,
  "105": 254327,
  "106": 151914,
  "107": 210227,
  "108": 274535,
  "109": 192462,
  "11": 8613,
  "110": 90812,
  "111": 65511,
  "112": 342779,
  "113": 48667,
  "114": 254964,
  "115": 46397,
  "116": 130018,
  "117": 153207,
  "118": 276756,
  "119": 151449,
  "12": 554951,
  "120": 179025,
  "121": 36411,
  "122": 65976,
  "123": 101583,
  "124": 31552,
  "125": 29709,
  "126": 241558,
  "127": 72182,
  "128": 301182,
  "129": 267755,
  "13": 14800,
  "130": 320899,
  "131": 205166,
  "132": 225912,
  "133": 113962,
  "134": 119004,
  "135": 28051,
  "136": 20307,
  "137": 125602,
  "138": 68893,
  "139": 110714,
  "14": 143721,
  "140": 26244,
  "141": 21870,
  "142": 12146,
  "143": 28232,
  "144": 8106,
  "145": 16770,
  "146": 67166,
  "147": 3357,
  "148": 44021,
  "149": 1703,
  "15": 9237,
  "150": 9802,
  "151": 4013,
  "152": 3389,
  "153": 7739,
  "154": 23336,
  "155": 8580,
  "156": 1593,
  "157": 1338,
  "158": 1973,
  "159": 1028,
  "16": 186822,
  "160": 830,
  "161": 7841,
  "162": 7549,
  "163": 629,
  "164": 3831,
  "165": 2792,
  "166": 124,
  "167": 978,
  "168": 633,
  "169": 99,
  "17": 2040,
  "170": 17,
  "171": 8,
  "172": 7,
  "173": 17,
  "174": 3,
  "175": 2,
  "176": 14,
  "177": 316,
  "178": 245,
  "179": 75,
  "18": 2063,
  "180": 330,
  "181": 350,
  "182": 30,
  "183": 577,
  "184": 50,
  "185": 26,
  "186": 1080,
  "187": 364,
  "188": 113,
  "189": 24,
  "19": 62293,
  "190": 21,
  "191": 12,
  "192": 200,
  "193": 42,
  "194": 39,
  "195": 5,
  "196": 3,
  "197": 2,
  "198": 1,
  "199": 1,
  "2": 199968,
  "20": 2496,
  "200": 25,
  "201": 33,
  "202": 75,
  "203": 0,
  "204": 0,
  "205": 0,
  "206": 0,
  "207": 0,
  "208": 0,
  "209": 0,
  "21": 5193,
  "210": 0,
  "211": 0,
  "212": 0,
  "213": 0,
  "214": 0,
  "215": 0,
  "216": 0,
  "217": 0,
  "218": 0,
  "219": 0,
  "22": 8675,
  "220": 0,
  "221": 0,
  "222": 0,
  "223": 0,
  "224": 0,
  "225": 0,
  "226": 0,
  "227": 34935,
  "228": 1352370,
  "229": 393615,
  "23": 31323,
  "230": 1137047,
  "231": 508597,
  "232": 1256267,
  "233": 451084,
  "234": 120205,
  "235": 450951,
  "236": 1217727,
  "237": 130698,
  "238": 47988,
  "239": 11447,
  "24": 45860,
  "240": 100783,
  "241": 149661,
  "242": 27402,
  "243": 35338,
  "244": 11150,
  "245": 9026,
  "246": 105324,
  "247": 188681,
  "248": 57891,
  "249": 7691,
  "25": 316281,
  "250": 6122,
  "251": 61769,
  "252": 25325,
  "253": 55768,
  "254": 26800,
  "255": 26592,
  "256": 17997,
  "257": 21906,
  "258": 4885,
  "259": 623,
  "26": 1070426,
  "260": 12832,
  "261": 14360,
  "262": 593,
  "263": 4443,
  "264": 1639,
  "265": 2737,
  "266": 12407,
  "267": 2725,
  "268": 1200,
  "269": 228,
  "27": 319816,
  "270": 546,
  "271": 2402,
  "272": 784,
  "273": 1143,
  "274": 1822,
  "275": 2331,
  "276": 10648,
  "277": 700,
  "278": 2651,
  "279": 5975,
  "28": 11403,
  "280": 309,
  "281": 3698,
  "282": 3993,
  "283": 310,
  "284": 247,
  "285": 3301,
  "286": 2042,
  "287": 1161,
  "288": 28701,
  "289": 1240,
  "29": 38811,
  "290": 1144,
  "291": 2094,
  "292": 1546,
  "293": 246,
  "294": 2313,
  "295": 2148,
  "296": 1559,
  "297": 4304,
  "298": 6697,
  "299": 7765,
  "3": 68155,
  "30": 2322,
  "300": 2323,
  "301": 508,
  "302": 306,
  "303": 206,
  "304": 505,
  "305": 316,
  "306": 355,
  "307": 4501,
  "308": 1501,
  "309": 264,
  "31": 3027,
  "310": 301,
  "311": 389,
  "312": 1648,
  "313": 229,
  "314": 234,
  "315": 159,
  "316": 2549,
  "317": 305,
  "318": 263,
  "319": 168,
  "32": 4782,
  "320": 159,
  "321": 546,
  "322": 263,
  "323": 136,
  "324": 327,
  "325": 198,
  "326": 223,
  "33": 425273,
  "34": 75371,
  "35": 11165,
  "36": 48080,
  "37": 11862,
  "38": 186876,
  "39": 20020,
  "4": 32390,
  "40": 63472,
  "41": 4199,
  "42": 6550,
  "43": 9169,
  "44": 10095,
  "45": 92357,
  "46": 24230,
  "47": 12659,
  "48": 95175,
  "49": 9202,
  "5": 13526,
  "50": 5022,
  "51": 2035,
  "52": 11062,
  "53": 36989,
  "54": 14699,
  "55": 5320,
  "56": 17805,
  "57": 7925,
  "58": 9339,
  "59": 17409,
  "6": 847075,
  "60": 22120,
  "61": 21360,
  "62": 4224,
  "63": 5009,
  "64": 5862,
  "65": 8241,
  "66": 23402,
  "67": 1297,
  "68": 6365,
  "69": 12116,
  "7": 278421,
  "70": 15128,
  "71": 3621,
  "72": 4436,
  "73": 4189,
  "74": 3199,
  "75": 6009,
  "76": 6898,
  "77": 7071,
  "78": 4358,
  "79": 4288,
  "8": 1616077,
  "80": 22878,
  "81": 4494,
  "82": 5944,
  "83": 1977,
  "84": 4478,
  "85": 3694,
  "86": 9493,
  "87": 1763,
  "88": 6704,
  "89": 10592,
  "9": 3929,
  "90": 8435,
  "91": 3643,
  "92": 3298,
  "93": 1745,
  "94": 5017,
  "95": 2882,
  "96": 2441,
  "97": 12332,
  "98": 5445,
  "99": 460536
}